In [60]:
import pandas
df = pandas.read_csv('marks_1.csv',sep='|',header=None)

In [61]:
df.columns = ['S.No.','Name','Subject','Maximum Marks','Marks Obtained','Percentage']

In [62]:
df

    S.No.     Name      Subject  Maximum Marks  Marks Obtained  Percentage
0       1   Akshay  Mathematics             50              40          80
1       2   Mahima      English             40              33          83
2       3    Vikas  Mathematics             50              42          84
3       4  Abhinav      English             40              31          78
4       5   Mahima      Science             50              40          80
5       6   Akshay      Science             50              49          98
6       7  Abhinav  Mathematics             50              47          94
7       8    Vikas      Science             50              40          80
8       9  Abhinav      Science             50              47          94
9      10    Vikas      English             40              39          98
10     11   Akshay      English             40              35          88
11     12   Mahima  Mathematics             50              43          86

In [63]:
import sqlite3

con = sqlite3.connect("marks.db")
cur = con.cursor()

In [64]:
%sql sqlite:///marks.db

In [65]:
df.to_sql("marks_data", con, if_exists='replace', index=False,method="multi")

12

In [66]:
con.close()

In [67]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [68]:
%sql select * from marks_data;

 * sqlite:///marks.db
Done.

[(1, 'Akshay', 'Mathematics', 50, 40, 80),
 (2, 'Mahima', 'English', 40, 33, 83),
 (3, 'Vikas', 'Mathematics', 50, 42, 84),
 (4, 'Abhinav', 'English', 40, 31, 78),
 (5, 'Mahima', 'Science', 50, 40, 80),
 (6, 'Akshay', 'Science', 50, 49, 98),
 (7, 'Abhinav', 'Mathematics', 50, 47, 94),
 (8, 'Vikas', 'Science', 50, 40, 80),
 (9, 'Abhinav', 'Science', 50, 47, 94),
 (10, 'Vikas', 'English', 40, 39, 98),
 (11, 'Akshay', 'English', 40, 35, 88),
 (12, 'Mahima', 'Mathematics', 50, 43, 86)]

In [69]:
%sql select * from marks_data where percentage >85;

 * sqlite:///marks.db
Done.

[(6, 'Akshay', 'Science', 50, 49, 98),
 (7, 'Abhinav', 'Mathematics', 50, 47, 94),
 (9, 'Abhinav', 'Science', 50, 47, 94),
 (10, 'Vikas', 'English', 40, 39, 98),
 (11, 'Akshay', 'English', 40, 35, 88),
 (12, 'Mahima', 'Mathematics', 50, 43, 86)]

In [77]:
%%sql

select name from sqlite_master where type="table"; -- to get the list of tables in sqlite

 * sqlite:///marks.db
Done.

[('marks_data',)]

In [79]:
%sql pragma table_info(marks_data) -- to get the list of attributes of the table

 * sqlite:///marks.db
Done.

[(0, 'S.No.', 'INTEGER', 0, None, 0),
 (1, 'Name', 'TEXT', 0, None, 0),
 (2, 'Subject', 'TEXT', 0, None, 0),
 (3, 'Maximum Marks', 'INTEGER', 0, None, 0),
 (4, 'Marks Obtained', 'INTEGER', 0, None, 0),
 (5, 'Percentage', 'INTEGER', 0, None, 0)]